{
  "backend/main.mo": "Motoko backend managing lead submissions, payment updates with authorization, and a global urgency slot system with timed resets.",
  "feature_evidence.json": "Feature evidence report listing implemented features, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files describing their roles in the app.",
  "frontend/index.css": "Tailwind base/theme configuration defining color variables for light and dark modes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/README.md": "Documentation explaining features, payment configuration, admin panel, and deployment setup.",
  "frontend/src/App.tsx": "Main React component orchestrating the landing page flow, admin panel toggle, and step transitions.",
  "frontend/src/components/AdminSubmissionsView.tsx": "Admin-only table view showing all submissions with payment status and timestamps.",
  "frontend/src/components/BackendConnectivityBanner.tsx": "Warning banner that appears when the backend is unreachable, using shadcn/ui Alert.",
  "frontend/src/components/LeadCaptureForm.tsx": "Form component that validates user details and submits them to the backend, handling errors and connectivity status.",
  "frontend/src/components/OfferDetails.tsx": "Displays Canva Pro offer pricing and a list of included premium features.",
  "frontend/src/components/PaymentConfirmation.tsx": "Shows a confirmation message after payment with expected access timeline and next steps.",
  "frontend/src/components/PaymentSection.tsx": "Provides QR code payment instructions and lets users mark their payment as completed by calling the backend.",
  "frontend/src/components/UrgencyBanner.tsx": "Fetches and displays the number of remaining discounted slots, showing a loading state when needed.",
  "frontend/src/config/index.ts": "Loads environment config and creates a properly configured backend actor for local or production use.",
  "frontend/src/config/payment.ts": "Stores static payment configuration including UPI link, amount, and product description.",
  "frontend/src/hooks/useActor.ts": "Initializes and caches the backend actor, updating it on identity changes and invalidating related queries.",
  "frontend/src/hooks/useBackendConnectivity.ts": "Checks backend reachability via a lightweight query and reports connectivity status.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity login, storing identity state, and exposing login status helpers.",
  "frontend/src/hooks/useQueries.ts": "Wraps react-query to fetch all submissions via the actor, enabled when the actor is ready.",
  "frontend/src/hooks/useUrgencySlots.ts": "Fetches remaining urgency slots from the actor with periodic refetching.",
  "frontend/src/index.css": "Defines Tailwind base styles and OKLCH theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/actorError.ts": "Normalizes and logs actor-related errors into structured categories and messages.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, and container settings with OKLCH variables.",
  "project_state.json": "Describes project state, features, architecture notes, and known issues for the Canva Pro landing workflow."
}