{
  "backend/main.mo": "Motoko backend canister handling submissions, payments, authorization, and urgency slot logic with storage and time-based resets.",
  "feature_evidence.json": "Feature evidence report listing feature requirements, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Mapping of frontend file paths to short descriptive summaries of their purpose within the app.",
  "frontend/index.css": "Tailwind-based global stylesheet defining color tokens and theme variables for light and dark modes.",
  "frontend/index.html": "HTML entry point loading the React application via main.tsx.",
  "frontend/README.md": "Project documentation describing features, flow, configuration steps, and deployment notes.",
  "frontend/src/App.tsx": "Main React app managing authentication, routing between form/payment/confirmation flows, and admin panel display.",
  "frontend/src/components/AdminSubmissionsView.tsx": "Admin-only table component showing all submissions with payment details, loading, and error states.",
  "frontend/src/components/BackendConnectivityBanner.tsx": "Shows a non-blocking warning banner when backend connectivity fails, hidden while checking or if reachable.",
  "frontend/src/components/LeadCaptureForm.tsx": "Handles lead capture input, validation, submission via actor, and displays connectivity and error states.",
  "frontend/src/components/OfferDetails.tsx": "Displays Canva Pro offer details with pricing, discount, and feature list.",
  "frontend/src/components/PaymentConfirmation.tsx": "Shows a confirmation message and next steps after successful payment.",
  "frontend/src/components/PaymentSection.tsx": "Displays payment QR/link and lets users confirm payment, updating backend and slot data.",
  "frontend/src/components/UrgencyBanner.tsx": "Fetches and displays remaining urgency slots, showing a loading indicator while fetching.",
  "frontend/src/config/index.ts": "Loads environment config and constructs a backend actor with proper host and root key handling.",
  "frontend/src/config/payment.ts": "Defines static payment configuration including UPI link, amount text, and product description.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on authentication state and refreshes dependent queries on changes.",
  "frontend/src/hooks/useBackendConnectivity.ts": "Performs a lightweight backend connectivity check using a simple actor query and exposes status flags.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication using Dfinity AuthClient, including login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines a React Query hook to fetch all submissions from the backend actor once available.",
  "frontend/src/hooks/useUrgencySlots.ts": "React Query hook that retrieves remaining urgency slots from the backend and refetches every 10 seconds.",
  "frontend/src/index.css": "Configures Tailwind base layers and color variables for light and dark themes with global styling rules.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider, then renders App.",
  "frontend/src/utils/actorError.ts": "Utilities for normalizing and logging backend/actor errors into structured, user-friendly formats.",
  "frontend/src/utils/urlParams.ts": "Extracts specified query parameters from the browser URL.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, plugins, and container settings.",
  "project_state.json": "Describes project architecture, features, known issues, and versioned state for a lead capture and payment flow system."
}