{
  "backend/main.mo": "Motoko backend handling lead submissions, payment marking with authorization, and urgency slot tracking with timed resets.",
  "feature_evidence.json": "Feature evidence report describing replacement of the QR asset with a user-uploaded image and listing related components and metadata.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of all frontend source files for reference or tooling.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables and light/dark theme values.",
  "frontend/index.html": "Base HTML entry point loading the React app via main.tsx with minimal page structure.",
  "frontend/public/env.example.json": "Example environment file specifying required keys for backend canister ID and network mode.",
  "frontend/public/env.json": "Production environment configuration providing the backend canister ID and network setting.",
  "frontend/README.md": "Project documentation outlining features, payment configuration, admin access, and setup instructions for the Canva Pro landing page.",
  "frontend/src/App.tsx": "Main React component managing the user flow between form, payment, and confirmation along with an admin panel toggle.",
  "frontend/src/components/AdminSubmissionsView.tsx": "Admin-only table view showing all submissions with payment status, timestamps, and access-denied handling.",
  "frontend/src/components/BackendConnectivityBanner.tsx": "Warning banner component that displays when the backend is unreachable, based on connectivity state.",
  "frontend/src/components/LeadCaptureForm.tsx": "Form component that collects user details and submits them to the backend while handling validation, submission states, and connectivity checks.",
  "frontend/src/components/OfferDetails.tsx": "Displays pricing, discount, and feature details for the Canva Pro offer using styled UI components.",
  "frontend/src/components/PaymentConfirmation.tsx": "Shows a confirmation message after payment with timeline details and next steps for the user.",
  "frontend/src/components/PaymentSection.tsx": "Provides QR payment options, a fallback payment link, and lets users mark their order as paid via backend interaction.",
  "frontend/src/components/UrgencyBanner.tsx": "Fetches and displays remaining urgency slots with loading and fallback handling.",
  "frontend/src/config/index.ts": "Loads environment config and creates a properly configured backend actor for local and production environments.",
  "frontend/src/config/payment.ts": "Defines static payment configuration including the UPI payment link, amount, and product description.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor, updating it based on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useBackendConnectivity.ts": "Runs a lightweight backend check using an actor call to determine reachability and connection status.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing ICP Internet Identity login, loading saved identities, and tracking login status.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching submissions and performing create/mark-as-paid mutations via the backend actor.",
  "frontend/src/hooks/useUrgencySlots.ts": "React Query hook that polls remaining urgency slots from the backend actor every 10 seconds.",
  "frontend/src/index.css": "Tailwind base and theme variable definitions for light/dark modes and global styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/actorError.ts": "Normalizes and logs actor-related errors into structured categories with user-friendly messages.",
  "frontend/src/utils/urlParams.ts": "Utility functions for getting, storing, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, typography, animations, and container settings.",
  "project_state.json": "Tracks project version, architecture notes, known issues, and feature definitions for a lead-collection and payment-flow app using Apps Script, Sheets, and a frontend. Includes image replacement requirements and flags this update as a fix request."
}