{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update payment QR asset, remove header login control, and revise payment confirmation message",
  "requirements": [
    {
      "id": "REQ-16",
      "summary": "Replace the payment QR image file used by the Payment Section while keeping the existing static asset path.",
      "acceptanceCriteria": [
        "The QR shown in the payment UI matches the uploaded QR image.",
        "The QR image is loaded from `/assets/generated/payment-qr.dim_512x512.png` and no backend image serving is introduced.",
        "No code changes are required to reference a different QR path (only the asset file is replaced)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/payment-qr.dim_512x512.png",
          "operation": "create",
          "description": "Replace/update the static asset content with the user-provided uploaded QR image, keeping the same filename and path so existing UI references remain unchanged."
        }
      ]
    },
    {
      "id": "REQ-17",
      "summary": "Remove the Login/Logout icon/button from the landing page header UI rendered in App.tsx.",
      "acceptanceCriteria": [
        "The header no longer renders the Login/Logout button and related icons (e.g., LogIn/LogOut).",
        "The rest of the landing page layout remains intact and functional (offer details, urgency banner, form, payment flow)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove the Login/Logout button from the header and clean up related imports/state/handlers (e.g., LogIn/LogOut imports and handleAuthToggle) while preserving the rest of the landing page flow and layout."
        }
      ]
    },
    {
      "id": "REQ-18",
      "summary": "Update the post-payment confirmation screen copy to prominently show the exact 10-minute access message after a successful mark-as-paid transition.",
      "acceptanceCriteria": [
        "After a successful `markAsPaid` action, the confirmation screen displays the exact sentence: “You will get access within 10 mins after checking your payment details”.",
        "The message is user-facing and clearly visible without needing to expand/click anything.",
        "No other user-facing text contradicts the 10-minute access expectation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PaymentConfirmation.tsx",
          "operation": "modify",
          "description": "Update the confirmation copy so the exact sentence “You will get access within 10 mins after checking your payment details” is prominently displayed, and revise/remove any other visible text that implies longer timelines (e.g., 'within 24 hours') to avoid contradictions."
        }
      ]
    }
  ]
}